# 3.Найдите количество элементов массива, которые отличны от наибольшего элемента не более чем на 10%.

num=int(input('введите число:\n'))
r=range(-num,num+1)
arr=list(r)
print (arr)