#  Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой\


line_1 = str(input('введите строку: '))
line_2 = str(input('введите строку: '))

count = 0 
for line_1 in line_2:
    count = count + 1
print(count)